#include <SPI.h>

#define SRCLK   (13)    // SPI:CLOCK
#define RCLK    (6)
#define SER     (11)    // SPI:MOSI

void setup() {
  pinMode(SRCLK, OUTPUT);
  pinMode(RCLK,  OUTPUT);
  pinMode(SER,   OUTPUT);

  SPI.begin();
  SPI.beginTransaction(SPISettings(1000000, MSBFIRST, SPI_MODE0));
}

// 点灯パターン(1=点灯, 0=消灯)
const uint8_t PATTERNS[] = {
  //LED_CUBE  :2
  //Main_Bpard:2
  //GND
  //*4545321
  0b00000000,
  //543*1321(下から
  0b00000001,

  //LED_RED
  //{{5,5},{4,5},{3,5},{1,5},{2,5}}
  0b00000000,
  //{{5,4},{4,4},{3,4},{1,4},{2,4}}//{3,4}は光らねぇ
  0b00000000,
  //{{5,3},{4,3},{3,3},{1,3},{2,3}}//{1,3}は光らねぇ
  0b00000000,
  //{{5,2},{4,2},{3,2},{1,2},{2,2}}
  0b00000000,
  //{{5,1},{4,1},{3,1},{1,1},{2,1}}
  0b01111111,

  //LED_BLUE
  //{{3,5},{4,5},{5,5},{1,5},{2,5}}
  0b00000000,
  //{{3,4},{4,4},{5,4},{1,4},{2,4}}
  0b00000000,
  //{{3,3},{4,3},{5,3},{1,3},{2,3}}
  0b00000000,
  //{{3,2},{4,2},{5,2},{1,2},{2,2}}
  0b01111111,
  //{{3,1},{4,1},{5,1},{1,1},{2,1}}
  0b00000000,

  //LED_GREEN
  //{{5,5},{4,5},{3,5},{1,5},{2,5}}
  0b00000000,
  //{{5,4},{4,4},{3,4},{1,4},{2,4}}
  0b00000000,
  //{{5,3},{4,3},{3,3},{1,3},{2,3}}
  0b01111111,
  //{{5,2},{4,2},{3,2},{1,2},{2,2}}
  0b00000000,
  //{{5,1},{4,1},{3,1},{1,1},{2,1}}
  0b00000000,
};


void loop() {

  // 点灯パターンの数
  int max_pattern = sizeof(PATTERNS) / sizeof(PATTERNS[0]);

  for (uint8_t i = 0; i < 17; i++) {
    // 8ビット分のデータをシフトレジスタへ送る
    SPI.transfer(PATTERNS[i]);

    // シフトレジスタの状態をストアレジスタへ反映させる
  }
  digitalWrite(RCLK,  LOW);
  digitalWrite(RCLK,  HIGH);
  delay(1000);
}
